"CIAdditionCompositing" = "Adiciona componentes de cor para alcançar um efeito de brilho. Este filtro geralmente é usado para adicionar efeitos de destaque e de reflexo de lente.";"CIAffineClamp" = "Executa uma transformação afim em uma imagem de origem e, em seguida, arrasta os pixels da borda da imagem transformada, estendendo-a para fora. Este filtro atua de forma similar ao filtro CIAffineTransform, exceto que ele produz uma imagem com extensão infinita. Você pode usar este filtro quando precisar desfocalizar uma imagem mas quer evitar uma franja negra e suave ao longo das bordas.";"CIAffineTile" = "Aplica uma transformação afim a uma imagem e, em seguida, a transforma em mosaico.";"CIAffineTransform" = "Aplica uma transformação afim à imagem. Você pode redimensionar, traduzir ou girar a imagem de entrada. Também é possível aplicar uma combinação destas operações.";"CIBarsSwipeTransition" = "Transições de uma imagem a outra ao passar porções retangulares da imagem em primeiro plano para mostrar a imagem de destino.";"CIBlendWithMask" = "Utiliza valores de uma máscara de escala de cinzas para interpolar entre uma imagem e o fundo. Quando o valor de uma máscara é 0,0, o resultado é o fundo. Quando o valor da máscara é 1,0, o resultado é a própria imagem.";"CIBloom" = "Suaviza as bordas e aplica um brilho agradável a uma imagem.";"CIBoxBlur" = "Suaviza ou melhora a nitidez de uma imagem usando um núcleo de convolução em forma de caixa.";"CIBumpDistortion" = "Cria uma saliência côncava ou convexa que é originada em um ponto especificado da imagem.";"CIBumpDistortionLinear" = "Cria uma saliência que é originada a partir de uma parte linear da imagem.";"CICMYKHalftone" = "Cria uma cor, execução do meio-tom na imagem de origem, usando as cores ciano, magenta, amarelo e preto sobre uma folha branca.";"CICheckerboardGenerator" = "Gera um padrão de tabuleiro. É possível especificar o tamanho e as cores do tabuleiro e a nitidez do padrão.";"CICircleSplashDistortion" = "Distorção dos pixels, com início na circunferência de um círculo e espalhando para fora.";"CICircularScreen" = "Simula uma tela de meios-tons em formato circular.";"CICircularWrap" = "Ajusta a imagem em torno de um círculo transparente. A distorção da imagem aumenta com a distância do centro do círculo.";"CIColorControls" = "Ajusta os valores de saturação, brilho e contraste.";"CIColorCube" = "Usa uma tabela de cores tridimensional para transformar os pixels da imagem de origem. A tabela de cores deve ser composta por células RGBA  de ponto flutuante que usem alfa pré-multiplicado. As células estão organizadas em uma ordem padrão. As colunas e as linhas dos dados estão indexados em vermelho e em verde, respectivamente. Cada plano de dados é seguido pelo plano posterior seguinte nos dados, com os planos indexados em azul.";"CIColorInvert" = "Inverte as cores de uma imagem.";"CIColorMap" = "Executa uma transformação não linear dos valores de cor fonte usando valores de mapeamento apresentados em uma tabela.";"CIColorMatrix" = "Multiplica os valores de cor fonte e adiciona um fator de viés a cada componente de cor.";"CIColorMonochrome" = "Remapeia as cores de modo a que se incluam entre os matizes de uma única cor.";"CIColorPosterize" = "Remapeia os componentes de vermelho, verde e azul para os valores da quantidade de brilho especificados para cada componente de cor. Este filtro compacta as cores para conseguir uma aparência de um pôster em serigrafia.";"CIComicEffect" = "Simula o desenho de uma revista em quadrinhos, contornando as bordas e aplicando efeitos de meios-tons.";"CIConstantColorGenerator" = "Gera uma cor sólida. Em geral, usa-se a saída desse filtro como entrada para outro filtro.";"CICopyMachineTransition" = "Transições de uma imagem para outra com a simulação do efeito de uma máquina copiadora.";"CICrop" = "Aplica um recorte à imagem. O tamanho e a forma da imagem recortada depende do retângulo especificado.";"CICrystallize" = "Cria blocos de cor em forma de polígono com a acumulação de valores de pixels fonte coloridos.";"CIDiscBlur" = "Suaviza ou torna nítida a imagem usando o núcleo da convolução em forma de disco.";"CIDisintegrateWithMaskTransition" = "As transições de uma imagem a outra usando a forma definida por uma máscara.";"CIDisplacementDistortion" = "Aplica os valores da escala de cinza da segunda imagem para a primeira. A imagem de saída apresenta uma textura definida pelos valores da escala de cinza.";"CIDissolveTransition" = "Usa uma dissolvência para transitar de imagem a outra.";"CIDotScreen" = "Simula os padrões de pontos de uma tela de meios-tons.";"CIEdges" = "Busca todas as bordas em uma imagem e as exibe em cor.";"CIEdgeWork" = "Produz uma execução estilizada em preto-e-branco de uma imagem, que parece semelhante a um recorte em um bloco de madeira.";"CIEightfoldReflectedTile" = "Produz uma imagem em mosaico a partir de uma imagem de origem aplicando uma simetria refletida de 8 vias.";"CIExposureAdjust" = "Ajusta a configuração da exposição para uma imagem semelhante à forma como se controla a exposição de uma câmera quando se muda a abertura do diafragma.";"CIFalseColor" = "A luminosidade dos mapas para uma palheta de cores de duas cores. Com freqüência é usada uma cor falsa para processar dados astronômicos e outros dados científicos, como imagens ultravioleta e de raios-x.";"CIFastBoxBlur" = "Suaviza ou melhora a nitidez de uma imagem usando um núcleo de convolução em forma de caixa.";"CIFastDiscBlur" = "Suaviza ou torna nítida a imagem usando o núcleo da convolução em forma de disco.";"CIFlashTransition" = "As transições de uma imagem para a outra com a criação de um flash. O flash se origina de um ponto especifico. Inicialmente pequeno, ele se expande rapidamente até que o quadro da imagem fique totalmente preenchido com a cor do flash. Na medida em que a cor esvaece, a imagem de destino começa a aparecer.";"CIFourfoldReflectedTile" = "Produz uma imagem em mosaico de uma imagem de origem aplicando-se a simetria refletida de 4 vias.";"CIFourfoldRotatedTile" = "Produz uma imagem em mosaico de uma imagem de origem fazendo a rotação da fonte em aumentos de 90 graus.";"CIFourfoldTranslatedTile" = "Produz uma imagem em mosaico de uma imagem de origem aplicando-se 4 operações de conversão.";"CIGammaAdjust" = "Ajusta a brilho de tons médios. Em geral, este filtro é usado para compensar os efeitos não lineares das telas. O ajuste de gama muda efetivamente o grau de transição entre preto e branco.";"CIGaussianBlur" = "Espalha pixels fonte na quantidade especificada por uma distribuição de Gauss.";"CIGaussianGradient" = "Gera um gradiente que varia de uma cor para outra usando a distribuição de Gauss.";"CIGlassDistortion" = "Distorce a imagem com a aplicação textura semelhante a vidro. As partes elevadas da imagem de saída são o resultado da aplicação de mapa de textura.";"CIGlassLozenge" = "Cria uma lente em formato de losango e distorce a parte da imagem sobre a qual a lente foi colocada.";"CIGlideReflectedTile" = "Produz a imagem em mosaico de uma imagem de origem com a conversão e o borramento da imagem.";"CIGloom" = "Ofusca o realce da imagem.";"CIHatchedScreen" = "Simula o padrão hachurado da tela em meios-tons.";"CIHeightFieldFromMask" = "Produz um campo de altura contínuo, tridimensional, em forma de curva da máscara em escala de cinza. Os valores do branco da máscara definem aqueles pixels que se encontram dentro do campo de altura enquanto os valores do preto definem aqueles pixels que estão fora. O campo varia suave e continuamente dentro da máscara, atingindo o valor 0 na borda da máscara. Você pode usar este filtro com o filtro CIShadedMaterial para produzir objetos sombreados extremamente realistas.";"CIHexagonalPixellate" = "Exibe a imagem como hexágonos coloridos cuja cor é a média dos pixels que eles substituem.";"CIHoleDistortion" = "Cria uma área circular que empurra os pixels da imagem para fora, distorcendo mais os pixels mais próximos do círculo.";"CIHueAdjust" = "Mudanças no matiz global, ou tonalidade, dos pixels fonte.";"CIKaleidoscope" = "Produz uma imagem caleidoscópica de uma imagem de origem, aplicando a simetria de 12 vias.";"CILanczosScaleTransform" = "Produz uma versão redimensionada e de alta qualidade da imagem de origem. Em geral, é possível usar este filtro para reduzir uma imagem.";"CILenticularHaloGenerator" = "Simula um aro gerado pela difração associada com a dilatação da lente. Em geral este filtro é aplicado a outra imagem para simular abertura ou dilatação de lentes e efeitos semelhantes.";"CILineOverlay" = "Cria um esboço que contorna as bordas de uma imagem em preto, deixando transparentes as partes não contornadas da imagem. O resultado possui alfa e é criado em preto, de forma a não aparecer muito até que seja colocado sobre outra imagem usando a fonte sobre composição.";"CILineScreen" = "Simula o padrão de linha de uma tela em meios-tons.";"CILinearGradient" = "Gera um gradiente que varia ao longo do eixo linear entre dois pontos finais definidos.";"CIMaskToAlpha" = "Converte a imagem em escala de cinza para uma branca, mascarada por alfa. Os valores de branco da imagem de origem produzem o interior da máscara, os valores do preto tornam-se completamente transparentes.";"CIMaximumCompositing" = "Computa o valor máximo, por componente de cor, de duas imagens de entrada e cria uma imagem de saída usando os valores máximos. É semelhante a menor exposição.";"CIMedianFilter" = "Computa o valor mediano para um grupo de pixels vizinhos e substitui cada valor de pixel com a mediana. O efeito é a redução do ruído.";"CIMinimumCompositing" = "Computa o valor mínimo, por componente de cor, de duas imagens de entrada e cria uma imagem de saída usando os valores mínimos. É semelhante a gravação.";"CIModTransition" = "As transições de uma imagem para outra, pela revelação da imagem de destino por meio de furos de formas irregulares.";"CIMotionBlur" = "Desfoca uma imagem para simular o efeito do uso de uma câmera que se move em ângulo e distância especificados enquanto a imagem é captada.";"CIMultiplyCompositing" = "Multiplica o componente de cor das duas imagens de entrada e cria uma imagem de saída usando os valores multiplicados. Em geral, este filtro é usado para adicionar um feixe luminoso, ou efeito de iluminação semelhante, a uma imagem.";"CINoiseReduction" = "Reduz o ruído com o uso de valor limiar para definir o que é considerado ruído. Pequenas mudanças na luminosidade abaixo desse valor são consideradas como ruído e recebem o tratamento de redução de ruído, que é um desfocado local. Mudanças acima do valor limite são consideradas bordas, assim são tornadas mais nítidas.";"CIOpTile" = "Segmenta a imagem, aplicando quaisquer rotação e redimensionamento especificados e, em seguida, monta a imagem novamente para dar uma aparência pop art.";"CIPageCurlTransition" = "As transições de uma imagem para outra com a simulação de uma página ondulada, revelando a nova imagem enquanto a página se ondula.";"CIParallelogramTile" = "Distorce uma imagem, refletindo-a em um paralelogramo e, em seguida, cobre o resultado.";"CIPerspectiveTile" = "Aplica uma transformação perspectiva em uma imagem e depois cobre o resultado.";"CIPerspectiveTransform" = "Altera a geometria da imagem para simular que o observador mudou a posição de visualização. É possível usar o filtro de perspectiva para distorcer a imagem.";"CIPinchDistortion" = "Cria área de forma retangular que comprime os pixels fonte para dentro, distorcendo mais os pixels mais próximos do retângulo.";"CIPixellate" = "Torna uma imagem maciça.";"CIPointillize" = "Converte a imagem de origem em estilo pontilhístico.";"CIRadialGradient" = "Gera um gradiente que varia radialmente entre dois círculos com o mesmo centro. É válida para um dos dois círculos que tenham raio igual a 0.";"CIRandomGenerator" = "Gera uma imagem de extensão infinita cujos valores de pixel são formados por quatro números aleatórios, independentes e distribuídos uniformemente no intervalo de 0 a 1.";"CIRippleTransition" = "Transições de uma imagem para outra com a criação de uma onda circular que se expande do ponto central, revelando a nova imagem no rastro da onda.";"CISepiaTone" = "Mapeia as cores de uma imagem para diversas tonalidades de marrom.";"CIShadedMaterial" = "Produz uma imagem sombreada de um campo de altura. O campo de altura é definido como tempo alturas maiores com tonalidades mais claras, e alturas menores (áreas mais baixas) com tonalidades mais escuras. É possível combinar este filtro com o filtro CIHeightFieldFromMask para produzir sombreados mais rápidos de máscaras, como por exemplo, um texto.";"CISharpenLuminance" = "Aumenta detalhes da imagem tornando-a mais nítida. Opera sobre a luminosidade da imagem; a cromatização dos pixels permanece inalterada.";"CISixfoldReflectedTile" = "Produz uma imagem em mosaico de uma imagem de origem aplicando-se a simetria refletida de 6 vias.";"CISixfoldRotatedTile" = "Produz uma imagem em mosaico de uma imagem de origem, girando a fonte em aumentos de 60 graus.";"CISourceAtopCompositing" = "Coloca a imagem de origem sobre a imagem de fundo, depois usa a luminosidade da imagem de fundo para determinar o que mostrar. A composição mostra a imagem de fundo e apenas aquelas partes da imagem de origem que estejam sobre partes visíveis do fundo.";"CISourceInCompositing" = "Usa a segunda imagem para definir o que deixar na imagem de origem, efetivamente recortando a imagem.";"CISourceOutCompositing" = "Usa a segunda imagem para definir o que retirar da primeira imagem.";"CISourceOverCompositing" = "Coloca a segunda imagem sobre a primeira.";"CISpotColor" = "Substitui uma ou mais variações de cores com cores especiais.";"CISpotLight" = "Aplica um efeito de refletor direcional a uma imagem.";"CIStarShineGenerator" = "Gera um padrão de estrela radiante. Em geral a imagem de saída é usada como entrada para outro filtro";"CIStripesGenerator" = "Gera um padrão de listras. É possível controlar a cor das listras, o espaçamento e o contraste.";"CISunbeamsGenerator" = "Gera um efeito solar. Em geral usa-se a saída do filtro de raios solares como a entrada para um filtro composto.";"CISwipeTransition" = "As transições de uma imagem para outra pela simulação de uma ação de golpeio.";"CITorusLensDistortion" = "Cria uma lente em formato saliente e distorce a porção da imagem sobre a qual a lente é colocada.";"CITriangleTile" = "Mapeia a parte triangular da imagem para uma área triangular e, em seguida, cobre o resultado.";"CITwelvefoldReflectedTile" = "Produz a imagem em mosaico de uma imagem de origem com a aplicação da simetria refletida de 12 vias.";"CITwirlDistortion" = "Gira os pixels em torno de um ponto para produzir um efeito giratório. É possível especificar a quantidade de giros bem como o centro e o raio do efeito.";"CIUnsharpMask" = "Aumenta o contraste das bordas entre pixels de cores diferentes em uma imagem.";"CIVortexDistortion" = "Gira os pixels em torno de um ponto para simular um vórtice. É possível especificar a quantidade de giros bem como o centro e o raio do efeito. ";"CIWhitePointAdjust" = "Ajusta o ponto branco de referência para uma imagem e mapeia todas as cores da fonte usando a nova referência.";"CIZoomBlur" = "Simula o efeito de aproximação da câmera enquanto capta a imagem.";"CIColorBlendMode" = "Usa os valores de luminosidade do fundo com os valores de saturação e de matiz da imagem de origem. Este modo preserva os níveis de cinza da imagem.";"CIColorBurnBlendMode" = "Escurece as amostras de imagem de fundo para refletir as amostras da imagem de origem. Os valores de amostra da imagem de origem que especifiquem o branco não produzem mudanças.";"CIColorDodgeBlendMode" = "Ilumina as amostras de imagem de fundo para refletir as amostras de imagem de origem. Os valores das amostras de imagem de origem que especificam preto não produzem mudanças.";"CIDarkenBlendMode" = "Cria amostras de imagens compostas por meio da escolha de amostras mais escuras (da imagem de origem ou da imagem de fundo). O resultado é que as amostras de imagens de fundo são substituídas por qualquer imagem de origem que seja mais escura. Caso contrário, as amostras de imagens de fundo são deixadas intocadas.";"CIDifferenceBlendMode" = "Subtrai a cor da amostra de imagem de origem da cor da amostra de imagem de fundo, ou o contrário, dependendo de qual amostra tem maior valor de brilho. Os valores das amostras de imagem de origem pretas não produzem mudanças; a branca inverte os valores de cor de fundo.";"CIExclusionBlendMode" = "Produz um efeito semelhante ao produzido pelo filtro CIDifferenceBlendMode, mas com menos contraste. Os valores das amostras de imagens de origem pretas não produzem mudanças; a branca inverte os valores da cor de fundo.";"CIHardLightBlendMode" = "Multiplica ou filtra as cores, dependendo da cor da amostra da imagem de origem. Se a cor da amostra da imagem de origem for mais clara do que cinza 50%, o fundo se aclara, semelhante à filtragem. Se a cor da amostra da imagem de origem for mais escura do que cinza 50%, o fundo se escurece, semelhante à multiplicação. Se a cor da amostra da imagem de origem for igual a cinza 50%, a imagem de origem não se modifica. Se as amostras de imagens forem iguais a preto puro ou branco puro, resulta em preto ou branco puro. O efeito global é semelhante ao que se obtém ao acender-se um refletor brilhante sobre a imagem de origem.";"CIHueBlendMode" = "Usa os valores de luminosidade e de saturação do fundo com o matiz da imagem de origem.";"CILightenBlendMode" = "Cria amostras de imagens compostas escolhendo as amostras mais claras (da imagem de origem ou do fundo). O resultado é que as amostras de imagem de fundo são substituídas por quaisquer imagens fonte mais claras. Caso contrário, as amostras de imagem de fundo permanecem intocadas.";"CILuminosityBlendMode" = "Usa o matiz e a saturação do fundo com a luminosidade da imagem de origem. Este modo cria um efeito inverso ao efeito criado pelo filtro CIColorBlendMode.";"CIMultiplyBlendMode" = "Multiplica as amostras de imagem de origem com as amostras de imagem de fundo. O resultado são cores que são pelo menos tão escuras quanto as duas cores da amostra contribuinte.";"CIOverlayBlendMode" = "Multiplica ou filtra as amostras de imagem de origem com as amostras de imagem de fundo, dependendo da cor do fundo. O resultado é a sobreposição das amostras de imagem existentes ao mesmo tempo que preserva os brilhos e as sombras do fundo. A cor de fundo se mistura com a imagem fundo para refletir a luminosidade ou a escuridão do fundo.";"CISaturationBlendMode" = "Usa os valores de luminosidade e de matiz do fundo com a saturação da imagem de origem. As áreas fundo que não tenham saturação (isto é, as áreas de cinza puro) não produzem mudanças.";"CIScreenBlendMode" = "Multiplica o inverso das amostras de imagem de origem pelo inverso das amostras de imagem de fundo. O resultado são cores que são, pelo menos, tão claras quanto uma das duas cores da amostra contribuinte.";"CISoftLightBlendMode" = "Escurece ou clareia as cores, dependendo da cor da amostra de imagem de origem. Se a cor da amostra de imagem de origem for mais clara do que cinza 50%, o fundo é clareado, semelhante a menor exposição. Se a cor da amostra de imagem de origem for mais escura do que cinza 50%, o fundo é escurecido, semelhante a gravação. Se a cor da amostra de imagem de origem for igual a cinza 50%, o fundo não muda. As amostras de imagem que são iguais a preto puro ou a branco puro produzem áreas mais claras ou mais escuras, mas não resultam em preto ou branco puro. O efeito geral é semelhante a acender um refletor difuso sobre a imagem de origem.";"outputImage" = "A imagem produzida por um filtro.";"inputBackgroundImage" = "A imagem a ser usada como imagem de fundo.";"inputImage" = "A imagem a ser usada como imagem de entrada. Para os filtros que usam também uma imagem de fundo, está é a imagem em primeiro plano.";"inputTime" = "A duração do efeito.";"inputTransform" = "A transformação a ser aplicada.";"inputScale" = "A quantidade do efeito.";"inputAspectRatio" = "A proporção da altura para a largura.";"inputCenter" = "O centro da área, tendo x e y como coordenadas, para filtrar.";"inputRadius" = "A distância do centro do efeito.";"inputAngle" = "Um ângulo.";"inputRefraction" = "O índice de refração do material (por ex. vidro) usado no efeito.";"inputWidth" = "A largura do efeito.";"inputSharpness" = "A quantidade de nitidez a ser aplicada.";"inputIntensity" = "A intensidade do efeito.";"inputEV" = "A quantidade de aberturas de diafragma mais brilhantes e mais escuros para compor a imagem.";"inputSaturation" = "A quantidade para ajustar a saturação.";"inputColor" = "Uma cor.";"inputBrightness" = "O nível de brilho.";"inputContrast" = "Um nível de contraste.";"inputGradientImage" = "Um mapa de ambiente com alfa. Em geral, esta é uma imagem que contém luz e sombra.";"inputMaskImage" = "A imagem de máscara.";"inputShadingImage" = "Um mapa do ambiente com valores alfa. Em geral, esta imagem contém luz e sombra.";"inputTargetImage" = "A imagem de destino de uma transição.";"inputExtent" = "O retângulo que define a extensão do efeito.";"CIBoxBlur.inputRadius" = "O raio determina quantos pixels são usados para criar o efeito desfocado. Quanto maior o raio, mais desfocado o resultado.";"CIDiscBlur.inputRadius" = "O raio determina quantos pixels são usados para criar o efeito desfocado. Quanto maior o raio, mais desfocado o resultado.";"CIGaussianBlur.inputRadius" = "O raio determina quantos pixels são usados para criar o efeito desfocado. Quanto maior o raio, mais desfocado o resultado.";"CIMotionBlur.inputRadius" ="O raio determina quantos pixels são usados para criar o efeito desfocado. Quanto maior o raio, mais desfocado o resultado.";"CIMotionBlur.inputAngle" = "O ângulo do movimento determina direção em que o desfocado se espalha.";"CINoiseReduction.inputNoiseLevel" = "A quantidade de redução de ruído. Quanto maior o valor, maior a redução do ruído.";"CINoiseReduction.inputSharpness" = "A nitidez da imagem final. Quanto maior o valor,  mais nítido o resultado.";"CIZoomBlur.inputCenter" = "As posições x e y a serem usadas como centro do efeito.";"CIZoomBlur.inputAmount" = "A quantidade de aproximação com zoom. Valores maiores resultam em maior ampliação.";"CIColorControls.inputSaturation" = "A quantidade de saturação a ser aplicada. Quanto maior o valor, mais saturado o resultado.";"CIColorControls.inputBrightness" = "A quantidade de brilho a ser aplicada. Quanto maior o valor, mais brilhante o resultado.";"CIColorControls.inputContrast" = "A quantidade de contraste a ser aplicada. Quanto maior o valor, mais contraste na imagem resultante.";"CIColorMatrix.inputRVector" = "A quantidade de vermelho pela qual multiplicar os valores de cor fonte.";"CIColorMatrix.inputGVector" = "A quantidade de verde pela qual multiplicar os valores de cor fonte.";"CIColorMatrix.inputBVector" = "A quantidade de azul pela qual multiplicar os valores de cor fonte.";"CIColorMatrix.inputAVector" = "A quantidade de alfa pela qual multiplicar os valores de cor fonte.";"CIColorMatrix.inputBiasVector" = "Um vetor adicionado a cada componente de cor.";"CIExposureAdjust.inputEV" = "A quantidade pela qual ajustar a exposição da imagem. Quanto maior o valor, mais brilhante a exposição.";"CIGammaAdjust.inputPower" = "O valor gama a ser usado para corrigir o brilho da imagem. Quanto maior o valor, mais escuro o resultado.";"CIHueAdjust.inputAngle" = "Um ângulo (em graus) a ser usado para corrigir o matiz da imagem.";"CIWhitePointAdjust.inputColor" = "A cor a ser usada como ponto branco.";"CIColorCube.inputDimension" = "A dimensão da tabela de cores.";"CIColorCube.inputCubeData" = "Esta é a tabela de cores das células RGBA de ponto flutuante que usam alfa pré-multiplicado. As células estão organizadas em uma ordem padrão. As colunas e as linhas dos dados estão indexados em vermelho e em verde, respectivamente. Cada plano de dados é seguido pelo plano posterior seguinte nos dados, com os planos indexados em azul.";"CIColorMap.inputGradientImage" = "Os dados de imagem desta imagem transforma os valores da imagem de origem.";"CIColorMonochrome.inputColor" = "A cor monocromática a ser aplicada na imagem.";"CIColorMonochrome.inputIntensity" = "A intensidade do efeito monocromático. O valor 1,0 cria uma imagem monocromática usando a cor fornecida. O valor 0,0 não apresenta efeito sobre a imagem.";"CIColorPosterize.inputLevels" = "A quantidade de níveis de brilho a ser usada para cada componente de cor. Valores menores resultam em um resultado de pôster mais extremo.";"CIFalseColor.inputColor0" = "A primeira cor a ser usada para a palheta de cores.";"CIFalseColor.inputColor1" = "A segunda cor a ser usada para a palheta de cores.";"CISepiaTone.inputIntensity" = "A intensidade do efeito sépia. O valor 1,0 cria uma imagem de sépia monocromática. O valor 0,0 não tem efeito sobre a imagem.";"CIBumpDistortion.inputCenter" = "As posições x e y para serem usadas como centro de saliência."; "CIBumpDistortion.inputRadius" = "O raio determina quantos pixels são usados para criar a distorção. Quanto maior o raio, mais ampla a extensão da distorção."; "CIBumpDistortion.inputScale" = "A escala do efeito determina a curvatura da saliência. Um valor de 0,0 não possui nenhum efeito. Os valores positivos criam uma saliência para fora, e os valores negativos criam uma saliência para dentro."; "CIBumpDistortionLinear.inputCenter" = "As posições x e y para serem usadas como centro da distorção."; "CIBumpDistortionLinear.inputRadius" = "O raio determina quantos pixels são usados para criar a distorção. Quanto maior o raio, mais ampla a extensão da distorção.";  "CIBumpDistortionLinear.inputScale" = "A escala do efeito."; "CIBumpDistortionLinear.inputAngle" = "O ângulo (em graus) da linha ao redor da qual ocorre a distorção."; "CICircleSplashDistortion.inputCenter" = "As posições x e y para serem usadas como centro da distorção.";  "CICircleSplashDistortion.inputRadius" = "O raio determina quantos pixels são usados para criar a distorção. Quanto maior o raio, mais ampla a extensão da distorção.";  "CICircularWrap.inputCenter" = "As posições x e y para serem usadas como centro da distorção.";  "CICircularWrap.inputRadius" = "O raio determina quantos pixels são usados para criar a distorção. Quanto maior o raio, mais ampla a extensão da distorção.";  "CICircularWrap.inputAngle" = "O ângulo do efeito."; "CIDisplacementDistortion.inputDisplacementImage" = "A imagem cujos valores de escala de cinza serão aplicados à imagem de origem."; "CIDisplacementDistortion.inputScale" = "A quantidade de texturização da imagem resultante. Quanto maior o valor, melhor a texturização."; "CIGlassDistortion.inputTexture" = "A textura a ser aplicada à imagem de origem.";"CIGlassDistortion.inputCenter" = "As posições x e y para serem usadas como centro da distorção."; "CIGlassDistortion.inputScale" = "A quantidade de texturização da imagem resultante. Quanto maior o valor, melhor a texturização."; "CIGlassLozenge.inputPoint0" = "As posições x e y que definem o centro do círculo em uma das extremidades do losango."; "CIGlassLozenge.inputPoint1" = "As posições x e y que definem o centro do círculo na outra extremidade do losango.";  "CIGlassLozenge.inputRadius" = "O raio do losango. Quanto maior o raio, mais ampla a extensão da distorção.";  "CIGlassLozenge.inputRefraction" = "A refração do vidro."; "CIHoleDistortion.inputCenter" = "As posições x e y para serem usadas como centro da distorção.";  "CIHoleDistortion.inputRadius" = "O raio determina quantos pixels são usados para criar a distorção. Quanto maior o raio, mais ampla a extensão da distorção.";  "CIPinchDistortion.inputCenter" = "As posições x e y para serem usadas como centro da distorção."; "CIPinchDistortion.inputRadius" = "O raio determina quantos pixels são usados para criar a distorção. Quanto maior o raio, mais ampla a extensão da distorção."; "CIPinchDistortion.inputScale" = "A quantidade de compressão. O valor de 0,0 significa sem efeito. O valor de 1,0 representa a máxima compressão.";"CITorusLensDistortion.inputCenter" = "As posições x e y a serem usadas como o centro da saliência.";  "CITorusLensDistortion.inputRadius" = "O raio externo da saliência.";  "CITorusLensDistortion.inputWidth" = "A largura do anel."; "CITorusLensDistortion.inputRefraction" = "A refração do vidro."; "CITwirlDistortion.inputCenter" = "As posições x e y para serem usadas como centro da distorção.";  "CITwirlDistortion.inputRadius" = "O raio determina quantos pixels são usados para criar a distorção. Quanto maior o raio, mais ampla a extensão da distorção."; "CITwirlDistortion.inputAngle" = "O ângulo (em graus) do giro. Os valores podem ser positivos ou negativos.";"CIVortexDistortion.inputCenter" = "As posições x e y para serem usadas como centro da distorção."; "CIVortexDistortion.inputRadius" = "O raio determina quantos pixels são usados para criar a distorção. Quanto maior o raio, mais ampla a extensão da distorção."; "CIVortexDistortion.inputAngle" = "O ângulo (em graus) do vórtice.";"CICheckerboardGenerator.inputColor0" = "A cor a ser usada no primeiro conjunto dos quadrados do tabuleiro.";"CICheckerboardGenerator.inputColor1" = "A cor a ser usada no segundo conjunto dos quadrados do tabuleiro.";"CICheckerboardGenerator.inputWidth" = "A largura do quadrado do padrão do tabuleiro.";"CICheckerboardGenerator.inputSharpness" = "A nitidez do padrão do tabuleiro. Quanto menor o valor, mais desfocado o padrão. Os valores variam de 0,0 a 1,0.";"CIConstantColorGenerator.inputColor" = "A cor a ser gerada."; "CILenticularHaloGenerator.inputCenter" = "As posições x e y a serem usadas como o centro do aro.";"CILenticularHaloGenerator.inputHaloRadius" = "O raio do aro.";"CILenticularHaloGenerator.inputHaloWidth" = "A largura do aro, do raio interno para o radio externo.";"CILenticularHaloGenerator.inputOverlap" = "A quantidade de sobreposição dos componentes de difração do aro. O valor 1,0 representa sobreposição total; o aro é branco. O valor 0,0 significa sem sobreposição; as cores do aro não se sobrepõem.";"CILenticularHaloGenerator.inputStriationStrength" = "A intensidade das cores do aro. Valores maiores são mais intensos.";"CILenticularHaloGenerator.inputStriationContrast" = "O contraste das cores do aro. Valores maiores significam contraste maior.";"CIStarShineGenerator.inputCenter" = "As posições x e y a serem usadas como o centro da estrela."; "CIStarShineGenerator.inputColor" = "A cor a ser usada para a shell externa da estrela circular."; "CIStarShineGenerator.inputRadius" = "O raio da estrela."; "CIStarShineGenerator.inputCrossScale" = "O tamanho do padrão cruzado."; "CIStarShineGenerator.inputCrossAngle" = "O ângulo do padrão cruzado."; "CIStarShineGenerator.inputCrossOpacity" = "A opacidade do padrão cruzado."; "CIStarShineGenerator.inputCrossWidth" = "A largura do padrão cruzado."; "CIStarShineGenerator.inputEpsilon" = "O comprimento das estacas cruzadas."; "CIStripesGenerator.inputCenter" = "As posições x e y a serem usadas como o centro do padrão de listras."; "CIStripesGenerator.inputColor0" = "A cor a ser usada para as listras ímpares."; "CIStripesGenerator.inputColor1" = "A cor a ser usada para as listras pares.";"CIStripesGenerator.inputWidth" = "A largura da listra."; "CIStripesGenerator.inputSharpness" = "A nitidez do padrão de listras. Quanto menor o valor, mais desfocado o padrão. Os valores variam de 0,0 a 1,0."; "CISunbeamsGenerator.inputCenter" = "As posições x e y a serem usadas como o centro do padrão de raio solar";"CISunbeamsGenerator.inputColor" = "A cor do sol.";"CISunbeamsGenerator.inputSunRadius" = "O raio do sol.";"CISunbeamsGenerator.inputMaxStriationRadius" = "O raio dos raios solares.";"CISunbeamsGenerator.inputStriationStrength" = "A intensidade dos raios solares. Valores maiores resultam em mais intensidade.";"CISunbeamsGenerator.inputStriationContrast" = "O contraste dos raios solares. Valores maiores resultam em mais contraste.";"CIAffineTransform.inputTransform" = "Uma transformação para aplicar à imagem."; "CICrop.inputRectangle" = "O retângulo que especifica o recorte a ser aplicado na imagem."; "CILanczosScaleTransform.inputScale" = "O fator de redimensionamento a ser usado na imagem. Os valores inferiores a 1,0 reduzem as imagens. Valores superiores a 1,0 aumentam a imagem."; "CILanczosScaleTransform.inputAspectRatio" = "A proporção da largura para a altura da imagem."; "CIPerspectiveTransform.inputTopLeft" = "A coordenada superior esquerda para a qual mapear a imagem."; "CIPerspectiveTransform.inputTopRight" = "A coordenada superior direita para a qual mapear a imagem."; "CIPerspectiveTransform.inputBottomRight" = "A coordenada inferior direita para a qual mapear a imagem."; "CIPerspectiveTransform.inputBottomLeft" = "A coordenada inferior esquerda para a qual mapear a imagem."; "CIGaussianGradient.inputColor0" = "A primeira cor a usar no gradiente."; "CIGaussianGradient.inputColor1" = "A segunda cor a usar no gradiente."; "CIGaussianGradient.inputRadius" = "O raio da distribuição de Gauss."; "CILinearGradient.inputPoint0" = "A posição inicial do gradiente -- onde começa a primeira cor."; "CILinearGradient.inputPoint1" = "A posição final do gradiente -- onde começa a segunda cor."; "CILinearGradient.inputColor0" = "A primeira cor a usar no gradiente.";  "CILinearGradient.inputColor1" = "A segunda cor a usar no gradiente.";  "CIRadialGradient.inputRadius0" = "O raio do círculo inicial a ser usado no gradiente.";"CIRadialGradient.inputRadius1" = "O raio do círculo final a ser usado no gradiente.";"CIRadialGradient.inputColor0" = "A primeira cor a usar no gradiente.";  "CIRadialGradient.inputColor1" = "A segunda cor a usar no gradiente."; "CICircularScreen.inputCenter" = "As posições x e y a serem usadas como centro do padrão de tela circular"; "CICircularScreen.inputWidth" = "A distância entre cada círculo no padrão."; "CICircularScreen.inputSharpness" = "A nitidez dos círculos. Quanto maior o valor, mais nítido o círculo."; "CICMYKHalftone.inputCenter" = "As posições x e y para serem usadas como centro do padrão de meio-tom";  "CICMYKHalftone.inputWidth" = "A distância entre pontos no padrão."; "CICMYKHalftone.inputAngle" = "O ângulo do padrão."; "CICMYKHalftone.inputSharpness" = "A nitidez do padrão. Quanto maior o valor, mais nítido o padrão."; "CICMYKHalftone.inputGCR" = "O valor de substituição do componente de cinza. O valor pode variar de 0,0 (nenhum) a 1,0."; "CICMYKHalftone.inputUCR" = "O valor do processo de remoção da cor. O valor pode variar de 0,0 a 1,0. "; "CIDotScreen.inputCenter" = "As posições x e y a serem usadas como centro do padrão de tela de pontos";  "CIDotScreen.inputAngle" = "O ângulo do padrão."; "CIDotScreen.inputWidth" = "A distância entre pontos no padrão."; "CIDotScreen.inputSharpness" = "A nitidez do padrão. Quanto maior o valor, mais nítido o padrão."; "CIHatchedScreen.inputCenter" = "As posições x e y a serem usadas como centro do padrão de tela hachurada"; "CIHatchedScreen.inputAngle" = "O ângulo do padrão.";"CIHatchedScreen.inputWidth" = "A distância entre as linhas do padrão."; "CIHatchedScreen.inputShaprness" = "A nitidez do padrão. Quanto maior o valor, mais nítido o padrão."; "CILineScreen.inputCenter" = "As posições x e y a serem usadas como o centro do padrão de tela de linha";  "CILineScreen.inputAngle" = "O ângulo do padrão."; "CILineScreen.inputWidth" = "A distância entre as linhas do padrão."; "CILineScreen.inputSharpness" = "A nitidez do padrão. Quanto maior o valor, mais nítido o padrão."; 	"CISharpenLuminance.inputSharpness" = "A quantidade de nitidez a ser aplicada. Valores maiores são mais nítidos.";"CIUnsharpMask.inputRadius" = "O raio em torno de um dado pixel para aplicar a máscara sem nitidez. Quanto maior o raio, mais a imagem é afetada.";"CIUnsharpMask.inputIntensity" = "A intensidade do efeito. Quanto maior o valor, mais contraste na área afetada.";"CIBlendWithMask.inputMaskImage" = "Uma máscara de escala de cinzas. Quando o valor de uma máscara é 0.0, o resultado é o fundo. Quando o valor da máscara é 1,0, o resultado é a própria imagem."; "CIBloom.inputRadius" = "O raio determina quantos pixels são usados para criar o efeito. Quanto maior o raio, melhor o efeito.";"CIBloom.inputIntensity" = "A intensidade do efeito. Um valor de 0,0 não é um efeito. O valor de 1,0 é o efeito máximo."; "CICrystallize.inputRadius" = "O raio determina quantos pixels foram usados para criar o efeito. Quanto maior o raio, maiores os cristais resultantes."; "CIEdges.inputIntensity" = "A intensidade das bordas. Quanto maior o valor, mais alta a intensidade."; "CIEdgeWork.inputRadius" = "A espessura das bordas. Quanto maior o valor, mais espessas as bordas."; "CIGloom.inputRadius" = "O raio determina quantos pixels são usados para criar o efeito. Quanto maior o raio, melhor o efeito."; "CIGloom.inputIntensity" = "A intensidade do efeito. Um valor de 0,0 não é um efeito. O valor de 1,0 é o efeito máximo."; "CIHeightFieldFromMask.inputImage" = "Os valores do branco da máscara definem aqueles pixels que se encontram dentro do campo de altura enquanto os valores do preto definem aqueles pixels que se encontram fora. O campo varia suave e continuamente dentro da máscara, atingindo o valor 0 na borda da máscara."; "CIHeightFieldFromMask.inputRadius" = "A distância da borda da máscara para a transição suave é proporcional ao raio de entrada. Os valores maiores fazem a transição mais suave e pronunciada. Os valores menores fazem a transição se aproximar do raio da curva."; "CIHexagonalPixellate.inputCenter" = "As posições x e y a serem usadas como centro do efeito"; "CIHexagonalPixellate.inputScale" = "A escala determina o tamanho dos hexágonos. Valores maiores resultam em hexágonos maiores."; "CILineOverlay.inputNRNoiseLevel" = "O nível de ruído da imagem (usado com dados de câmera) removido antes de rastrear as bordas da imagem. O aumento do nível de ruído ajuda a alinhar as bordas rastreadas da imagem."; "CILineOverlay.inputNRSharpness" = "A quantidade de nitidez obtida quando se remove o ruído da imagem antes de rastrear as bordas da imagem. Isso melhora a aquisição das bordas."; "CILineOverlay.inputEdgeIntensity" = "O fator de acentuação das informações do gradiente Sobel quando se rastreia as bordas da imagem. Valores maiores encontram mais bordas, embora, em geral, seja usado um valor baixo (por ex. 1,0)."; "CILineOverlay.inputThreshold" = "Este valor determina a visibilidade da borda. Valores maiores diluem as bordas."; "CILineOverlay.inputContrast" = "A quantidade de anti-serrilhado a ser usada nas bordas produzidas por este filtro. Valores maiores produzem bordas de maior contraste (são menos anti-serrilhadas)."; "CIPixellate.inputCenter" = "As posições x e y a serem usadas como centro do efeito";  "CIPixellate.inputScale" = "A escala determina o tamanho dos quadrados. Valores maiores resultam em quadrados maiores."; "CIPointillize.inputRadius" = "O raio dos círculos no padrão resultante."; "CIPointillize.inputCenter" = "As posições x e y a serem usadas como centro do efeito";  "CIShadedMaterial.inputShadingImage" = "A imagem a ser usada como campo de altura. A imagem resultante tem alturas maiores com tonalidades mais claras e alturas menores (áreas mais baixas) com tonalidades mais escuras."; "CIShadedMaterial.inputScale" = "A escala do efeito. Quanto maior o valor, mais espetacular o efeito."; "CISpotColor.inputCenterColor1" = "O valor central do primeiro intervalo de cores a substituir."; "CISpotColor.inputReplacementColor1" = "Uma cor de substituição para a primeira variação de cores."; "CISpotColor.inputCloseness1" = "O valor que indica quanto a primeira cor deve combinar antes de ser substituída."; "CISpotColor.inputContrast1" = "O contraste da primeira cor de substituição."; "CISpotColor.inputCenterColor2" = "O valor central do segundo intervalo de cores a substituir."; "CISpotColor.inputReplacementColor2" = "Uma cor de substituição para a segunda variação de cores.";"CISpotColor.inputCloseness2" = "O valor que indica quanto a segunda cor deve combinar antes de ser substituída."; "CISpotColor.inputContrast2" = "O contraste da segunda cor de substituição."; "CISpotColor.inputCenterColor3" = "O valor central do terceiro intervalo de cores a substituir.";  "CISpotColor.inputReplacementColor3" = "Uma cor de substituição para a terceira variação de cores."; "CISpotColor.inputCloseness3" = "O valor que indica quanto a terceira cor deve combinar antes de ser substituída.";  "CISpotColor.inputContrast3" = "O contraste da terceira cor de substituição.";  "CISpotLight.inputLightPosition" = "As posições x e y do refletor."; 		"CISpotLight.inputLightPointsAt" = "As posições x e y para as quais o refletor aponta.";  "CISpotLight.inputBrightness" = "O brilho do refletor."; "CISpotLight.inputConcentration" = "O tamanho do refletor. Quanto menor o valor, mais diretamente focalizado o feixe de luz."; "CISpotLight.inputColor" = "A cor do refletor."; "CIAffineClamp.inputTransform" = "A transformação para aplicar à imagem."; "CIAffineTile.inputTransform" = "A transformação para aplicar à imagem."; "CIEightfoldReflectedTile.inputCenter" = "As posições x e y a serem usadas como centro do efeito";  "CIEightfoldReflectedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico."; "CIEightfoldReflectedTile.inputWidth" = "A largura de um mosaico."; "CIFourfoldReflectedTile.inputCenter" = "As posições x e y a serem usadas como centro do efeito";  "CIFourfoldReflectedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CIFourfoldReflectedTile.inputAcuteAngle" = "O ângulo primário para a repetição do mosaico refletido. Valores pequenos criam mosaicos em formato de diamante finos e valores maiores criam mosaicos em diamante mais espessos."; "CIFourfoldReflectedTile.inputWidth" = "A largura de um mosaico.";  "CIFourfoldRotatedTile.inputCenter" = "As posições x e y a serem usadas como centro do efeito";  "CIFourfoldRotatedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CIFourfoldRotatedTile.inputWidth" = "A largura de um mosaico."; "CIFourfoldTranslatedTile.inputCenter" = "As posições x e y a serem usadas como centro do efeito";  "CIFourfoldTranslatedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "O ângulo primário para a repetição do mosaico convertido. Valores pequenos criam mosaicos em formato de diamante finos, e valores maiores criam mosaicos em diamante mais espessos."; "CIFourfoldTranslatedTile.inputWidth" = "A largura de um mosaico.";  "CIGlideReflectedTile.inputCenter" = "As posições x e y a serem usadas como centro do efeito";  "CIGlideReflectedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CIGlideReflectedTile.inputWidth" = "A largura de um mosaico.";  "CIKaleidoscope.inputCount" = "O número de reflexões de um padrão."; "CIKaleidoscope.inputCenter" = "As posições x e y a serem usadas como centro do efeito";  "CIKaleidoscope.inputAngle" = "O ângulo de reflexão."; "CIOpTile.inputCenter" = "As posições x e y a serem usadas como centro do efeito";  "CIOpTile.inputScale" = "A escala determina a quantidade de mosaicos do efeito."; "CIOpTile.inputAngle" = "O ângulo de um mosaico."; "CIOpTile.inputWidth" = "A largura de um mosaico."; "CIParallelogramTile.inputCenter" = "As posições x e y a serem usadas como centro do efeito"; "CIParallelogramTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CIParallelogramTile.inputAcuteAngle" = "O ângulo primário para o mosaico de paralelogramo repetido. Valores pequenos criam mosaicos em formato de diamante finos e valores mais altos criam mosaicos de paralelogramo mais espessos."; "CIParallelogramTile.inputWidth" = "A largura de um mosaico.";  "CIPerspectiveTile.inputTopLeft" = "A coordenada superior esquerda de um mosaico."; "CIPerspectiveTile.inputTopRight" = "A coordenada superior direita de um mosaico.";"CIPerspectiveTile.inputBottomRight" = "A coordenada inferior direita de um mosaico."; "CIPerspectiveTile.inputBottomLeft" = "A coordenada inferior esquerda de um mosaico."; "CISixfoldReflectedTile.inputCenter" = "As posições x e y a serem usadas como centro do efeito";  "CISixfoldReflectedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CISixfoldReflectedTile.inputWidth" = "A largura de um mosaico."; "CISixfoldRotatedTile.inputCenter" = "As posições x e y a serem usadas como centro do efeito"; "CISixfoldRotatedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CISixfoldRotatedTile.inputWidth" = "A largura de um mosaico.";  "CITriangleTile.inputCenter" = "As posições x e y a serem usadas como centro do efeito";  "CITriangleTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";  "CITriangleTile.inputWidth" = "A largura de um mosaico.";  "CITwelvefoldReflectedTile.inputCenter" = "As posições x e y a serem usadas como centro do efeito"; "CITwelvefoldReflectedTile.inputAngle" = "O ângulo (em graus) do padrão em mosaico.";"CITwelvefoldReflectedTile.inputWidth" = "A largura de um mosaico."; "CIBarsSwipeTransition.inputAngle" = "O ângulo (em graus) das barras.";	"CIBarsSwipeTransition.inputWidth" = "A largura de cada barra.";	"CIBarsSwipeTransition.inputBarOffset" = "O deslocamento de uma barra em relação à outra";	"CIBarsSwipeTransition.inputTime" = "O tempo parametrizado da transição. Este valor direciona a transição do início (na hora 0) ao término (na hora 1).";"CICopyMachineTransition.inputColor" = "A cor da luz da copiadora.";"CICopyMachineTransition.inputAngle" = "O ângulo de luz da copiadora.";"CICopyMachineTransition.inputWidth" = "A amplitude da luz da copiadora. ";"CICopyMachineTransition.inputOpacity" = "A opacidade da luz da copiadora. O valor 0,0 é transparente. O valor 1,0 é opaco.";"CICopyMachineTransition.inputTime" = "O tempo parametrizado da transição. Este valor direciona a transição do início (na hora 0) ao término (na hora 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "A imagem definidora da forma a ser usada quando se dá a desintegração da fonte para a imagem de destino.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "O raio da sombra criada pela máscara.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "A densidade da sombra criada pela máscara.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "O deslocamento da sombra criada pela máscara.";"CIDisintegrateWithMaskTransition.inputTime" = "O tempo parametrizado da transição. Este valor direciona a transição do início (na hora 0) ao término (na hora 1).";"CIDissolveTransition.inputTime" = "O tempo parametrizado da transição. Este valor direciona a transição do início (na hora 0) ao término (na hora 1).";"CIFlashTransition.inputCenter" = "As posições x e y a serem usadas como centro do efeito"; "CIFlashTransition.inputExtent" = "A extensão do flash.";"CIFlashTransition.inputColor" = "A cor dos raios de luz emanados do flash.";"CIFlashTransition.inputMaxStriationRadius" = "O raio dos raios de luz emanados do flash.";"CIFlashTransition.inputStriationStrength" = "A força dos raios de luz emanados do flash.";"CIFlashTransition.inputStriationContrast" = "O contraste dos raios de luz emanados do flash.";"CIFlashTransition.inputFadeThreshold" = "A quantidade de esvaecimento entre o flash e a imagem de destino. Quanto maior o valor, mais tempo de flash e menos tempo de esvaecimento.";"CIFlashTransition.inputTime" = "O tempo parametrizado da transição. Este valor direciona a transição do início (na hora 0) ao término (na hora 1).";"CIModTransition.inputCenter" = "As posições x e y a serem usadas como centro do efeito"; "CIModTransition.inputAngle" = "O ângulo do padrão de furo de modulação.";"CIModTransition.inputRadius" = "O raio dos furos não distorcidos do padrão.";"CIModTransition.inputCompression" = "A quantidade de expansão aplicada ao padrão do furo de modulação. Os furos do centro não ficam distorcidos tanto quanto os da borda da imagem.";"CIModTransition.inputTime" = "O tempo parametrizado da transição. Este valor direciona a transição do início (na hora 0) ao término (na hora 1).";"CIPageCurlTransition.inputBacksideImage" = "A imagem que aparece no fundo da imagem de origem, enquanto a página se ondula para revelar a imagem de destino.";"CIPageCurlTransition.inputShadingImage" = "Uma imagem que parece uma esfera sombreada fechada em uma imagem de quadrado.";"CIPageCurlTransition.inputExtent" = "A extensão do efeito.";"CIPageCurlTransition.inputAngle" = "O ângulo da página ondulada.";"CIPageCurlTransition.inputRadius" = "O raio do ondulado.";"CIPageCurlTransition.inputTime" = "O tempo parametrizado da transição. Este valor direciona a transição do início (na hora 0) ao término (na hora 1).";"CIRippleTransition.inputShadingImage" = "Uma imagem que parece uma esfera sombreada fechada em uma imagem de quadrado.";"CIRippleTransition.inputCenter" = "As posições x e y a serem usadas como centro do efeito"; "CIRippleTransition.inputExent" = "A extensão do efeito.";"CIRippleTransition.inputWidth" = "A largura da ondulação.";"CIRippleTransition.inputScale" = "O valor que determina se a ondulação se inicia como uma saliência (valor mais alto) ou uma depressão (valor menor).";"CIRippleTransition.inputTime" = "O tempo parametrizado da transição. Este valor direciona a transição do início (na hora 0) ao término (na hora 1).";"CISwipeTransition.inputExtent" = "A extensão do efeito.";"CISwipeTransition.inputColor" = "A cor do golpe.";"CISwipeTransition.inputAngle" = "O ângulo do golpe.";"CISwipeTransition.inputWidth" = "A largura do golpe";"CISwipeTransition.inputOpacity" = "A opacidade do golpe.";"CISwipeTransition.inputTime" = "O tempo parametrizado da transição. Este valor direciona a transição do início (na hora 0) ao término (na hora 1).";"CIAreaHistogram" = "Calcula um histograma para a área especificada em uma imagem, retornando o resultado em uma imagem 1D.";"CIAreaHistogram.inputExtent" = "Um retângulo que especifica a sub-região da imagem que você deseja processar.";"CIAreaHistogram.inputCount" = "O número de bins em um histograma.";"CIAreaHistogram.inputImage" = "A imagem cujo histograma você deseja calcular.";"CIAreaHistogram.inputScale" = "O valor de ajuste a usar com os valores do histograma.";"CIAreaMaximum" = "Calcula os valores de componentes máximos para a área especificada em uma imagem, retornando o resultado em um pixel.";"CIAreaMaximum.inputExtent" = "Um retângulo que especifica a sub-região da imagem que você deseja processar.";"CIAreaMaximum.inputImage" = "A imagem a ser processada.";"CIAreaMinimum" = "Calcula os valores de componentes mínimos para a área especificada em uma imagem, retornando o resultado em um pixel.";"CIAreaMinimum.inputExtent" = "Um retângulo que especifica a sub-região da imagem que você deseja processar.";"CIAreaMinimum.inputImage" = "A imagem a ser processada.";"CIAreaMaximumAlpha" = "Encontra e retorna o pixel com o valor de alfa máximo.";"CIAreaMaximumAlpha.inputExtent" = "Um retângulo que especifica a sub-região da imagem que você deseja processar.";"CIAreaMaximumAlpha.inputImage" = "A imagem a ser processada.";"CIAreaMinimumAlpha" = "Encontra e retorna o pixel com o valor de alfa mínimo.";"CIAreaMinimumAlpha.inputExtent" = "Um retângulo que especifica a sub-região da imagem que você deseja processar.";"CIAreaMinimumAlpha.inputImage" = "A imagem a ser processada.";"CIAreaAverage" = "Calcula a cor média para a área especificada em uma imagem, retornando o resultado em um pixel.";"CIAreaAverage.inputExtent" = "Um retângulo que especifica a sub-região da imagem que você deseja processar.";"CIAreaAverage.inputImage" = "A imagem a ser processada.";"CIRowAverage" = "Calcula a cor média para cada fila da área especificada em uma imagem, retornando o resultado em uma imagem 1D.";"CIRowAverage.inputExtent" = "Um retângulo que especifica a sub-região da imagem que você deseja processar.";"CIRowAverage.inputImage" = "A imagem a ser processada.";"CIColumnAverage" = "Calcula a cor média para cada coluna da área especificada em uma imagem, retornando o resultado em uma imagem 1D.";"CIColumnAverage.inputExtent" = "Um retângulo que especifica a sub-região da imagem que você deseja processar.";"CIColumnAverage.inputImage" = "A imagem a ser processada.";"CIMinimumComponent" = "Converte uma imagem à escala de cinzas usando o mínimo dos componentes de três cores.";"CIMinimumComponent.inputExtent" = "Um retângulo que especifica a sub-região da imagem que você deseja processar.";"CIMinimumComponent.inputImage" = "A imagem a ser processada.";"CIMaximumComponent" = "Converte uma imagem à escala de cinzas usando o máximo dos componentes de três cores.";"CIMaximumComponent.inputExtent" = "Um retângulo que especifica a sub-região da imagem que você deseja processar.";"CIMaximumComponent.inputImage" = "A imagem a ser processada.";